In [1]:
import numpy as np
import pandas as pd
import seaborn as sb

# seaborn 패키지의 iris 데이터로 데이터 프레임 생성
df_iris = sb.load_dataset('iris')
df_iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [ ]:
df_iris.transpose(inplace = True)

In [ ]:
df_iris

In [ ]:

df_iris

In [21]:
# 딕셔서리를 정의
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# 딕셔서리를 데이터프레임으로 변환. 인덱스를 [r0, r1, r2]로 지정
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [24]:
df.sort_values(by='c1', ascending=False, inplace = True)

In [25]:
df

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [2]:
# 특정 열(column)을 데이터프레임의 행 인덱스(index)로 설정 
ndf = df.set_index(['이름'])
print(ndf)

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [3]:
df.set_index(['이름'],
                  inplace = True)

In [4]:
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [3]:
import pandas as pd

In [4]:
data = ('영인', '2010-05-01', '여', True)

In [39]:
sr=pd.Series(data,
          index=['이름', '생년월일', '성별', '학생여부'])
sr

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

In [46]:
sr['이름':'학생여부':]

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

In [49]:
sr[ : : 3]

이름        영인
학생여부    True
dtype: object

In [50]:
import pandas as pd

In [58]:
df = pd.read_csv('C:/Users/Administrator/GitHub/TIL/ADP_study/rawdata/auto-mpg.csv')
df

     18.0  8  307.0  130.0   3504.  12.0  70  1 chevrolet chevelle malibu
0    15.0  8  350.0  165.0  3693.0  11.5  70  1         buick skylark 320
1    18.0  8  318.0  150.0  3436.0  11.0  70  1        plymouth satellite
2    16.0  8  304.0  150.0  3433.0  12.0  70  1             amc rebel sst
3    17.0  8  302.0  140.0  3449.0  10.5  70  1               ford torino
4    15.0  8  429.0  198.0  4341.0  10.0  70  1          ford galaxie 500
..    ... ..    ...    ...     ...   ...  .. ..                       ...
392  27.0  4  140.0  86.00  2790.0  15.6  82  1           ford mustang gl
393  44.0  4   97.0  52.00  2130.0  24.6  82  2                 vw pickup
394  32.0  4  135.0  84.00  2295.0  11.6  82  1             dodge rampage
395  28.0  4  120.0  79.00  2625.0  18.6  82  1               ford ranger
396  31.0  4  119.0  82.00  2720.0  19.4  82  1                chevy s-10

[397 rows x 9 columns]

In [62]:
df.shape

TypeError: 'tuple' object is not callable

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 9 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   18.0                       397 non-null    float64
 1   8                          397 non-null    int64
 2   307.0                      397 non-null    float64
 3   130.0                      397 non-null    object
 4   3504.                      397 non-null    float64
 5   12.0                       397 non-null    float64
 6   70                         397 non-null    int64
 7   1                          397 non-null    int64
 8   chevrolet chevelle malibu  397 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.0+ KB

In [63]:
type( df.info )

method

In [64]:
type (df.info() )

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 9 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   18.0                       397 non-null    float64
 1   8                          397 non-null    int64
 2   307.0                      397 non-null    float64
 3   130.0                      397 non-null    object
 4   3504.                      397 non-null    float64
 5   12.0                       397 non-null    float64
 6   70                         397 non-null    int64
 7   1                          397 non-null    int64
 8   chevrolet chevelle malibu  397 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.0+ KB

NoneType

In [2]:
a = np.array(["foo", "foo", "foo", "foo", "bar", "bar",
              "bar", "bar", "foo", "foo", "foo"], dtype=object)
b = np.array(["one", "one", "one", "two", "one", "one",
              "one", "two", "two", "two", "one"], dtype=object)
c = np.array(["dull", "dull", "shiny", "dull", "dull", "shiny",
              "shiny", "dull", "shiny", "shiny", "shiny"],
             dtype=object)

pd.crosstab(a, [b, c], rownames=['a'], colnames=['b', 'c'])

b    one        two
c   dull shiny dull shiny
a
bar    1     2    1     0
foo    2     2    1     2

In [7]:
from scipy.stats import chi2
from scipy.stats import chisquare
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [8]:
## 데이터 생성
observed_, expected_ = [18,55,27], [25,50,25]
ct_1 = pd.DataFrame([observed_, expected_], columns=["1","2","3"], index=['A', 'B'])
ct_1

    1   2   3
A  18  55  27
B  25  50  25

In [9]:
## 카이제곱검정 통계량 계산
observed = ct_1.loc["A"]
expected = ct_1.loc["B"]

chi_squared_test = (observed-expected).pow(2)/expected
chi_squared_statistic=chi_squared_test.sum()
print(chi_squared_statistic) ##2.62

2.62

In [10]:
## 카이제곱검정 수행(적합도 검정)
dof = 3-1
chi_ = chi2(dof)
chi_05 = chi_.ppf(0.95)
print(chi_05) ## 5.991464547107979

5.991464547107979

In [11]:
if chi_squared_statistic >= chi_05:
    print("H0 기각")
else :
    print("H0 채택")
    
## H0 채택 : 우리가 가정한 모집단과 다르다고 말할 수 없다

p_val=1-chi_.cdf(chi_squared_statistic)
print(p_val) ## 0.26982005638468687

H0 채택
0.26982005638468687